In [26]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df = pd.read_csv('J:/csv/apply_demo.csv')

In [6]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [10]:
df.size

7978

In [11]:
s1 = Series(['a'] * 7978)

In [12]:
df['A'] = s1

In [14]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [15]:
df['A'] = df['A'].apply(str.upper)

In [17]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [24]:
# data 中数据 需要做列拆分
# strip() 去除首尾空格
# split() 分隔数据项
# df['data'][0].strip().split(' ')

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [33]:
# 自定义函数进行处理
def foo(data):
    items = data.strip().split(' ')
    return Series([items[1], items[3], items[5]])

In [34]:
# 临时df 存储分隔后的 date列
df_temp = df['data'].apply(foo)

In [37]:
df_temp.head()

      0  1     2
0  APPL  0  1623
1  APPL  0  1623
2  APPL  0  1623
3  APPL  0  1623
4  APPL  1  1649

In [41]:
# 列重命名
df_new = df_temp.rename(columns={
    0: 'Symbol',
    1: 'Seqno',
    2: 'Price'
})

In [42]:
df_new.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [45]:
# 将分隔完成的列添加到原df上
df_ = df.combine_first(df_new)

In [47]:
df_.head()

   A   Price  Seqno Symbol                                data        time
0  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  A  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [50]:
# 去除不必要的A列和data列
del df_['A']

In [52]:
del df_['data']

In [55]:
df_.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [56]:
# 保存至文件
df_.to_csv('demo_duplicate.csv')